#!/bin/bash
echo "Задание №50"

echo "Ну здравствуй, сладкий."
echo "Это теоретическая часть посвящена Bash скриптам"
echo "инструкция по созданию bash скрипта:"
echo "1)c помощью команды touch создайте файл bash.sh"
echo "2)выдайте права этому файлу при помощи: chmod +x ./bash.sh"
echo "3)войдите в свой скрипт, используя vim или nano(как больше нравится)"
echo "4)войдя в файл, пропишите первой строкой: #!/bin/bash"
echo "5)выйдите из файла с сохранением"
echo "6)запустите свой скрипт при помощи ./bash.sh"

echo "так как в вашем файле пусто, то при запуске скрипта нечего не произойдет, поэтому ниже вы можете посмотреть список команд для bash"

echo "это было введение в bash скрипты, больше информации вы сможете найти в интернете или при помощт команды man bash.
в следующих заданиях вам будет даны задания по этой теме, удачи и да прибудет с вами Linux."

sleep 3600